{
    "epochs": 25,
	"batch_size": [10, 20, 35, 50, 70, 100],
	"lr": 1e-7,
    "arquitectura": {
      "class_name": "Sequential",
      "config": {
          "name": "sequential",
          "layers": [
            {"class_name": "Flatten",
              "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"}
            },
            {"class_name": "Dense",
              "config": {
                "name": "dense1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {"seed": null}
                  },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                  },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null}
              },
              {"class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.1,
                  "noise_shape": null,
                  "seed": null}
                }
            ]
          },
          "keras_version": "2.2.4-tf",
          "backend": "tensorflow"
    }
}
