[
    {
        "epochs": 30,
        "batch_size": 100,
        "conv2d": {
            "num_filters": [
                20,
                32,
                54,
                96,
                128,
                254
            ],
            "kernel_size": [
                3,
                3,
                3,
                3,
                2,
                1
            ],
            "stride": [
                2,
                2,
                1,
                1,
                1,
                1
            ],
            "max_pooling": [
                0,
                0,
                1,
                1,
                1,
                1
            ]
        },
        "dense": {
            "layers": [
                70,
                64
            ],
            "dropout": [
                0.1,
                0.1
            ]
        },
        "script": "/media/nico/USB DISK/M\u00e1ster en Ciencia de Datos e Ingenier\u00eda de COmputadores/Mineria de datos aspectos avanzados/script8.py",
        "arquitectura": {
            "name": "sequential",
            "layers": [
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            256,
                            256,
                            3
                        ],
                        "dtype": "float32",
                        "filters": 20,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_2",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 54,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_3",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 96,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_4",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 128,
                        "kernel_size": [
                            2,
                            2
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_2",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_5",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 254,
                        "kernel_size": [
                            1,
                            1
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "name": "max_pooling2d_3",
                        "trainable": true,
                        "dtype": "float32",
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 70,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 64,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "name": "dropout_1",
                        "trainable": true,
                        "dtype": "float32",
                        "rate": 0.1,
                        "noise_shape": null,
                        "seed": null
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 45,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
            ]
        },
        "resultados": {
            "loss_train": 0.42860862419672824,
            "accuracy_train": 0.8669748902320862,
            "loss_test": 0.8541108465963795,
            "accuracy_test": 0.7467532753944397,
            "ratio_loss_train_val": 0.5018185003793454,
            "mean_f1_score_test": 0.7508802006679473
        }
    }
]